# 01、python控制流--判断
#     什么是分支判断？
# 	    一条一条语句顺序执行叫做顺序结构
# 		分支结构就是在某个判断条件后，选择一条分支去执行
# 02、什么是分支判断
# 	一条一条语句顺序执行叫做顺序结构
# 	分支结构就是在某个判断条件后，选择一条分支去执行
# 03、if 条件判断
# 	# if后面要有判断条件
# 	if 判断条件:
# 	# 执行语句需要注意缩进
# 		执行语句
# 04、else 判断语句
#
# 	if 判断条件:
# 	# 执行语句需要注意缩进
# 		执行语句
# 	# 注意，无需添加条件
# 	else:
# 		执行语句
# 05、elif 多重条件
#
# 	# elif后面要有判断条件
# 	if 判断条件:
# 	# 执行语句需要注意缩进
# 		执行语句
# 	elif 判断条件:
# 		执行语句
# 	elif 判断条件:
# 		执行语句
# 06、分支嵌套
# 	# elif后面要有判断条件
# 	if 判断条件:
# 	# 执行语句需要注意缩进
# 		if 判断条件:
# 			执行语句
# 	elif 判断条件:
# 		if 判断条件:
# 			执行语句
# 	# 注意，无需添加条件
# 	else:
# 		if 判断条件:
# 			执行语句
# 07、三目运算符
# 	# 正常的赋值操作和判断语句结合
# 	if a>b:
# 		h = "变量1"
# 	else:
# 		h = "变量2"
# 	# 优化之后更简洁的写法
# 	h = "变量1" if a>b else "变量2"
Bob = "运维"
range = "高级"
if Bob == "tester":
	print("软件测试工程师")
	if range == "高级":
		print("高级软件测试工程师")
elif Bob == "运维" and range == "高级":
		print("高级运维工程师")
else:
	print("软件开发工程师")
	if range == "高级":
		print("高级软件开发工程师")
